import logging

from core.database import TextType, ChromadbDb

entity_info = "1经验球,2拴绳结,3画,4箭,5雪球,6火球,7小火球,9末影珍珠,10末影信号,11扔出的经验瓶,12物品展示框,13凋零骷髅头,14点燃的TNT,15掉落的方块,16烟花火箭,17命令方块矿车,18船,19普通矿车,20储物箱矿车,21动力矿车,22TNT矿车,23漏斗矿车,24刷怪笼矿车,25苦力怕,26骷髅,27蜘蛛,28巨人,29僵尸,30史莱姆,31恶魂,32僵尸猪人,33末影人,34洞穴蜘蛛,35蠹虫,36烈焰人,37岩浆怪,38末影龙,39凋零兽,40蝙蝠,41女巫,42猪,43羊,44牛,45鸡,46鱿鱼,47狼,48哞菇（蘑菇牛）,49雪人,50豹猫（金钩豹）,51铁傀儡（铁巨人）,52马（普通马）,53村民（普通村民）,54末影水晶,55飞溅药水（喷溅药水）,56鸡蛋,57鱼钩"
material_info = "1空气,2石头,3草方块,4泥土,5圆石,6木头,7树苗,8基岩,9水（流动）,10水（静止）,11岩浆（流动）,12岩浆（静止）,13沙子,14砂砾,15金矿石,16铁矿石,17煤矿石,18木头原木,19树叶,20海绵,21玻璃,22青金石矿石,23青金石块,24发射器,25沙石,26木板响石,27床方块,28动力铁轨,29检测铁轨,30粘性活塞,31蜘蛛网,32长草,33烧焦的灌木丛,34活塞底座,35活塞臂,36羊毛,37移动的活塞臂,38金黄色的花,39红玫瑰,40棕色蘑菇,41红色蘑菇,42金块,43铁块,44双台阶,45台阶,46砖块,47TNT,48书架,49苔藓圆石,50黑曜石,51火把,52火焰,53刷怪笼,54木质楼梯,55木箱子,56红石线路,57钻石矿石,58钻石块,59工作台,60农作物方块（小麦种子、西瓜种子、南瓜种子、甘蔗、胡萝卜、马铃薯）,61耕地方块（需要种植农作物）,62熔炉（未点燃）,63熔炉（点燃状态）,64支撑物（告示牌）,65木门（下半部分）,66梯子方块,67铁轨方块（直线、弯曲、上升、下降）,68圆石楼梯方块,69墙上的告示牌方块,70电门方块,71压力板（轻质、重质）,72铁门（下半部分）,73木质压力板（轻质、重质）,74红石矿石（未点亮）,75红石矿石（点亮状态）,76红石火把（未点亮）,77红石火把（点亮状态）,78石质按钮方块,79雪块方块（积雪层）,80冰块方块（透明、不透明）,81雪块方块（整个方块）,82仙人掌方块（可以造成伤害）,83黏土方块,84甘蔗方块（可以种植在耕地上）,85唱片机方块,86木栅栏方块,87南瓜方块（可以雕刻成灯笼）,88地狱岩方块,89幽灵沙方块（行走速度减缓）,90萤石方块（发光）,91末地传送门方块（需要点亮）,92南瓜灯笼方块（发光）,93蛋糕方块（可以食用）,94红石中继器方块（未激活状态）,95红石中继器方块（激活状态）,96锁定箱子方块,97染色玻璃方块,98活板门,99虫蛋岩,100平滑石头,101大型蘑菇,102大型蘑菇,103铁栏杆,104薄玻璃,105西瓜,106南瓜梗,107西瓜梗,108藤蔓,109栅栏门,110砖楼梯,111平滑楼梯,112菌丝,113荷叶,114地狱砖,115地狱栅栏,116地狱砖楼梯,117地狱裂草,118附魔台,119酿造台,120长釜,121末地传送门,122末地传送门框架,123末地石,124龙蛋,125关闭的红石灯,126打开的红石灯,127木制双半砖,128木制半砖,129可可果,130沙石阶梯,131绿宝石矿石,132末影箱,133绊线钩,134绊线,135绿宝石方块,136云杉木阶梯,137桦木阶梯,138丛林木阶梯,139命令方块,140信标,141圆石墙,142花盆,143胡萝卜,144马铃薯,145木质按钮,146骷髅头颅,147铁砧,148陷阱箱,149金质压力板,150铁质压力板,151关闭的红石比较器,152打开的红石比较器,153日光传感器,154红石块,155石英矿石,156漏斗,157石英块,158石英阶梯,159激活铁轨,160投掷器,161染色粘土块,162染色玻璃板,163丛林树叶,164丛林树木原木,165金合欢木阶梯,166黑橡木阶梯,167干草块,168地毯,169硬化粘土块,170煤炭块,171压缩冰块,172高草丛,173铁锹,174铁镐,175铁斧,176打火石,177苹果,178弓,179箭,180煤炭,181钻石,182铁锭,183金锭,184铁剑,185木剑,186木锹,187木镐,188木斧,189石剑,190石锹,191石镐,192石斧,193钻石剑,194钻石锹,195钻石镐,196钻石斧,197木棍,198碗,199蘑菇汤,200金剑,201金锹,202金镐,203金斧,204线,205羽毛,206硫磺,207木锄,208石锄,209铁锄,210钻石锄,211金锄,212小麦种子,213小麦,214面包,215皮革帽子,216皮革外套,217皮革裤子,218皮革靴子,219锁链头盔,220锁链胸甲,221锁链护腿,222锁链靴子,223铁头盔,224铁胸甲,225铁护腿,226铁靴子,227钻石头盔,228钻石胸甲,229钻石护腿,230钻石靴子,231金头盔,232金胸甲,233金护腿,234金靴子,235打火石,236生猪肉,237熟猪肉,238画,239金苹果,240告示牌,241木门,242桶,243水桶,244岩浆桶,245矿车,246鞍,247铁门,248红石粉,249雪球,250小船,251皮革,252牛奶桶,253粘土砖,254粘土球,255甘蔗,256纸张,257书,258史莱姆球,259存储矿车,260动力矿车,261鸡蛋,262指南针,263钓鱼竿,264手表,265萤石粉,266生鱼片,267熟鱼片,268墨囊/墨水袋/染料/黑色染料,269骨头,270糖,271蛋糕,272床,273重复性红石电路/红石中继器/红石延迟器,274曲奇饼干/小甜饼,275地图,276剪刀,277西瓜,278南瓜种子,279西瓜种子,280生牛肉,281牛排,282生鸡肉,283熟鸡肉,284腐肉,285末影珍珠,286火焰棒,287恶魂之泪,288金粒,289地狱菌棒,290药水,291玻璃瓶,292蜘蛛眼,293发酵蜘蛛眼,294烈焰粉,295岩浆膏,296酿造台,297大锅,298末影之眼,299闪烁的西瓜,300刷怪蛋,301经验瓶,302火球,303书和羽毛笔,304写好的书,305绿宝石,306物品展示框,307盆栽,308胡萝卜,309马铃薯,310烤马铃薯,311有毒马铃薯,312空地图,313金色胡萝卜,314骷髅头颅,315胡萝卜钓竿,316下界之星,317南瓜派,318烟花火箭,319烟花星球,320附魔之书,321红石比较器,322下界砖块,323下界石英,324炸药矿车,325漏斗矿车,326铁马甲,327金马甲,328钻石马甲,329拴绳,330名称标签,331命令方块矿车,332黄金唱片,333绿色唱片,334第三张唱片,335第四张唱片,336第五张唱片,337第六张唱片,338第七张唱片,339第八张唱片,340第九张唱片,341第十张唱片,342第十一张唱片,343第十二张唱片"
enchantment_info = "1环境保护,2火焰保护,3跌落保护,4爆炸保护,5弹射物保护,6氧气,7水中速掘,8荆棘,9锋利,10亡灵杀手,11节肢杀手,12击退,13火焰附加,14掠夺,15效率,16精准采集,17耐久,18时运,19力量,20冲击,21火矢,22无限,23幸运,24饵钓"
brewing_info = "粗制药水=水瓶+地狱疣,迅捷药水=粗制药水+糖,迟缓药水=迅捷药水+发酵蜘眼,迟缓药水=跳跃药水+发酵蜘眼,跳跃药水=粗制药水+兔子腿,力量药水=粗制药水+烈焰粉,治疗药水=粗制药水+闪烁西瓜,剧毒药水=粗制药水+蜘蛛眼,伤害药水=治疗药水+发酵蜘眼,伤害药水=剧毒药水+发酵蜘眼,再生药水=粗制药水+恶魂之泪,抗火药水=粗制药水+岩浆膏,水肺药水=粗制药水+河豚,夜视药水=粗制药水+金胡萝卜,隐身药水=夜视药水+发酵蜘眼,神龟药水=粗制药水+海龟壳,缓降药水=粗制药水+幻翼膜,虚弱药水=水瓶+发酵蜘眼,喷溅药水=水瓶+火药,延长药水=任意药水+红石"
cmd_info = "传送: /tp [玩家名],修改时间: /time set,修改游戏模式: /gamemode 0生存 1创造 2冒险 3旁观,自杀: /kill,修改天气: /weather,死亡不掉落: /gamerule keepInventory true"

logging.basicConfig(level=logging.INFO)
# 给大模型添加背景知识
if __name__ == '__main__':
    db = ChromadbDb()
    for entity in entity_info.split(","):
        logging.info("add entity {}".format(entity))
        db.add_content(entity, TextType.Entity)
    for material in material_info.split(","):
        logging.info("add material {}".format(material))
        db.add_content(material, TextType.Material)
    for enchantment in enchantment_info.split(","):
        logging.info("add enchantment {}".format(enchantment))
        db.add_content(enchantment, TextType.Enchantment)
    for brewing in brewing_info.split(","):
        logging.info("add brewing {}".format(brewing))
        db.add_content(brewing, TextType.Brewing)
    for cmd in cmd_info.split(","):
        logging.info("add cmd {}".format(cmd))
        db.add_content(cmd, TextType.Command)
    print(db.query_content("给我5级 '精准采集' 钻石镐", 20))